Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH048.atdf
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR1__OVRSAM">
         <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right output data is in 15.1 format) / (If DFMODE is 1) 256 samples (256 samples to be averaged)" name="" value="0x7" />
         <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right output data is in 14.1 format) / (If DFMODE is 1) 128 samples (128 samples to be averaged)" name="" value="0x6" />
         <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right output data is in 13.1 format) / (If DFMODE is 1) 64 samples (64 samples to be averaged)" name="" value="0x5" />
         <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right output data is in 12.1 format) / (If DFMODE is 1) 32 samples (32 samples to be averaged)" name="" value="0x4" />
         <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right output data is 16 bits) / (If DFMODE is 1) 16 samples (16 samples to be averaged)" name="" value="0x3" />
         <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right output data is 15 bits) / (If DFMODE is 1) 8 samples (8 samples to be averaged)" name="" value="0x2" />
         <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right output data is 14 bits) / (If DFMODE is 1) 4 samples (4 samples to be averaged)" name="" value="0x1" />
         <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right output data is 13 bits) / (If DFMODE is 1) 2 samples (2 samples to be averaged)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR1__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1" />
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR1__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1" />
         <value caption="Only the first 12 bits are significant" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Enable bit" name="ADCFLTR1__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1" />
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR2__CHNLID">
         <value caption="AN27 input" name="" value="0x1b" />
         <value caption="AN26 input" name="" value="0x1a" />
         <value caption="AN25 input" name="" value="0x19" />
         <value caption="AN24 input" name="" value="0x18" />
         <value caption="AN23 input" name="" value="0x17" />
         <value caption="AN22 input" name="" value="0x16" />
         <value caption="AN21 input" name="" value="0x15" />
         <value caption="AN20 input" name="" value="0x14" />
         <value caption="AN19 input" name="" value="0x13" />
         <value caption="AN18 input" name="" value="0x12" />
         <value caption="AN17 input" name="" value="0x11" />
         <value caption="AN16 input" name="" value="0x10" />
         <value caption="AN15 input" name="" value="0xf" />
         <value caption="AN14 input" name="" value="0xe" />
         <value caption="AN13 input" name="" value="0xd" />
         <value caption="AN12 input" name="" value="0xc" />
         <value caption="AN11 input" name="" value="0xb" />
         <value caption="AN10 input" name="" value="0xa" />
         <value caption="AN9 input" name="" value="0x9" />
         <value caption="AN8 input" name="" value="0x8" />
         <value caption="AN7 input" name="" value="0x7" />
         <value caption="AN6 input" name="" value="0x6" />
         <value caption="ADC5 Module" name="" value="0x5" />
         <value caption="ADC4 Module" name="" value="0x4" />
         <value caption="ADC3 Module" name="" value="0x3" />
         <value caption="ADC2 Module" name="" value="0x2" />
         <value caption="ADC1 Module" name="" value="0x1" />
         <value caption="ADC0 Module" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Data Ready Status bit" name="ADCFLTR2__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1" />
         <value caption="Data is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Interrupt Enable bit" name="ADCFLTR2__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1" />
         <value caption="Digital filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR2__OVRSAM">
         <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right output data is in 15.1 format) / (If DFMODE is 1) 256 samples (256 samples to be averaged)" name="" value="0x7" />
         <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right output data is in 14.1 format) / (If DFMODE is 1) 128 samples (128 samples to be averaged)" name="" value="0x6" />
         <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right output data is in 13.1 format) / (If DFMODE is 1) 64 samples (64 samples to be averaged)" name="" value="0x5" />
         <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right output data is in 12.1 format) / (If DFMODE is 1) 32 samples (32 samples to be averaged)" name="" value="0x4" />
         <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right output data is 16 bits) / (If DFMODE is 1) 16 samples (16 samples to be averaged)" name="" value="0x3" />
         <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right output data is 15 bits) / (If DFMODE is 1) 8 samples (8 samples to be averaged)" name="" value="0x2" />
         <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right output data is 14 bits) / (If DFMODE is 1) 4 samples (4 samples to be averaged)" name="" value="0x1" />
         <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right output data is 13 bits) / (If DFMODE is 1) 2 samples (2 samples to be averaged)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR2__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1" />
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0" />
      </value-group>
