Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH048.atdf
      <value-group caption="Trigger Source for Conversion of Analog Input AN20 Select bits" name="ADCTRG6__TRGSRC20">
         <value caption="PWM Generator 12 trigger" name="" value="0x1e" />
         <value caption="PWM Generator 11 trigger" name="" value="0x1d" />
         <value caption="PWM Generator 10 trigger" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="PWM Generator 9 trigger" name="" value="0x17" />
         <value caption="PWM Generator 8 trigger" name="" value="0x16" />
         <value caption="PWM Generator 7 trigger" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge only) " name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see the following Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN21 Select bits" name="ADCTRG6__TRGSRC21">
         <value caption="PWM Generator 12 trigger" name="" value="0x1e" />
         <value caption="PWM Generator 11 trigger" name="" value="0x1d" />
         <value caption="PWM Generator 10 trigger" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="PWM Generator 9 trigger" name="" value="0x17" />
         <value caption="PWM Generator 8 trigger" name="" value="0x16" />
         <value caption="PWM Generator 7 trigger" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge only) " name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see the following Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN22 Select bits" name="ADCTRG6__TRGSRC22">
         <value caption="PWM Generator 12 trigger" name="" value="0x1e" />
         <value caption="PWM Generator 11 trigger" name="" value="0x1d" />
         <value caption="PWM Generator 10 trigger" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="PWM Generator 9 trigger" name="" value="0x17" />
         <value caption="PWM Generator 8 trigger" name="" value="0x16" />
         <value caption="PWM Generator 7 trigger" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge only) " name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see the following Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN23 Select bits" name="ADCTRG6__TRGSRC23">
         <value caption="PWM Generator 12 trigger" name="" value="0x1e" />
         <value caption="PWM Generator 11 trigger" name="" value="0x1d" />
         <value caption="PWM Generator 10 trigger" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="PWM Generator 9 trigger" name="" value="0x17" />
         <value caption="PWM Generator 8 trigger" name="" value="0x16" />
         <value caption="PWM Generator 7 trigger" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge only) " name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see the following Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
