Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH048.atdf
         <register caption="" name="a1" offset="0x14" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="a1" />
         </register>
         <register caption="" name="a2" offset="0x18" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="a2" />
         </register>
         <register caption="" name="a3" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="a3" />
         </register>
         <register caption="" name="t0" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t0" />
         </register>
         <register caption="" name="t1" offset="0x24" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t1" />
         </register>
         <register caption="" name="t2" offset="0x28" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t2" />
         </register>
         <register caption="" name="t3" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t3" />
         </register>
         <register caption="" name="t4" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t4" />
         </register>
         <register caption="" name="t5" offset="0x34" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t5" />
         </register>
         <register caption="" name="t6" offset="0x38" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t6" />
         </register>
         <register caption="" name="t7" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t7" />
         </register>
         <register caption="" name="s0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s0" />
         </register>
         <register caption="" name="s1" offset="0x44" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s1" />
         </register>
         <register caption="" name="s2" offset="0x48" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s2" />
         </register>
         <register caption="" name="s3" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s3" />
         </register>
         <register caption="" name="s4" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s4" />
         </register>
         <register caption="" name="s5" offset="0x54" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s5" />
         </register>
         <register caption="" name="s6" offset="0x58" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s6" />
         </register>
         <register caption="" name="s7" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s7" />
         </register>
         <register caption="" name="t8" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t8" />
         </register>
         <register caption="" name="t9" offset="0x64" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t9" />
         </register>
         <register caption="" name="k0" offset="0x68" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="k0" />
         </register>
         <register caption="" name="k1" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="k1" />
         </register>
         <register caption="" name="gp" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="gp" />
         </register>
         <register caption="" name="sp" offset="0x74" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="sp" />
         </register>
         <register caption="" name="fp" offset="0x78" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="fp" />
         </register>
         <register caption="" name="ra" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ra" />
         </register>
         <register caption="" name="Index" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="Index" />
            <bitfield mask="0x80000000" name="P" />
         </register>
         <register caption="" name="Random" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="Random" />
         </register>
         <register caption="" name="EntryLo0" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x00000001" name="G" />
            <bitfield mask="0x00000002" name="V" />
            <bitfield mask="0x00000004" name="D" />
            <bitfield mask="0x00000038" name="C" />
            <bitfield mask="0x03FFFFC0" name="PFN" />
            <bitfield mask="0x40000000" name="XI" />
            <bitfield mask="0x80000000" name="RI" />
         </register>
         <register caption="" name="EntryLo1" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="G" />
            <bitfield mask="0x00000002" name="V" />
            <bitfield mask="0x00000004" name="D" />
            <bitfield mask="0x00000038" name="C" />
            <bitfield mask="0x03FFFFC0" name="PFN" />
            <bitfield mask="0x40000000" name="XI" />
            <bitfield mask="0x80000000" name="RI" />
         </register>
         <register caption="" name="Context" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x007FFFF8" name="BadVPN2" />
            <bitfield mask="0xFF800000" name="PTEBase" />
         </register>
         <register caption="" name="UserLocal" offset="0x94" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="USERLOCAL" />
         </register>
         <register caption="" name="PageMask" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x1FFFE000" name="Mask" />
         </register>
         <register caption="" name="PageGrain" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x08000000" name="IEC" />
            <bitfield mask="0x40000000" name="XIE" />
            <bitfield mask="0x80000000" name="RIE" />
         </register>
