Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH048.atdf
         <register caption="" name="Wired" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="Wired" />
         </register>
         <register caption="" name="HWREna" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="Mask" />
            <bitfield mask="0x20000000" name="ULR" />
         </register>
         <register caption="" name="BadVAddr" offset="0xa8" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BadVAddr" />
         </register>
         <register caption="" name="BadInstr" offset="0xac" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BadInstr" />
         </register>
         <register caption="" name="BadInstrP" offset="0xb0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BadInstrP" />
         </register>
         <register caption="" name="Count" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Count" />
         </register>
         <register caption="" name="EntryHi" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="ASID" />
            <bitfield mask="0xFFFFE000" name="VPN2" />
         </register>
         <register caption="" name="Compare" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Compare" />
         </register>
         <register caption="" name="Status" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="IE" />
            <bitfield mask="0x00000002" name="EXL" />
            <bitfield mask="0x00000004" name="ERL" />
            <bitfield mask="0x00000010" name="UM" />
            <bitfield mask="0x0001FC00" name="IPL" />
            <bitfield mask="0x00040000" name="IPL7" />
            <bitfield mask="0x00080000" name="NMI" />
            <bitfield mask="0x00100000" name="SR" />
            <bitfield mask="0x00200000" name="TS" />
            <bitfield mask="0x00400000" name="BEV" />
            <bitfield mask="0x01000000" name="MX" />
            <bitfield mask="0x02000000" name="RE" />
            <bitfield mask="0x04000000" name="FR" />
            <bitfield mask="0x08000000" name="RP" />
            <bitfield mask="0x10000000" name="CU0" />
            <bitfield mask="0x20000000" name="CU1" />
         </register>
         <register caption="" name="IntCtl" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x000003E0" name="VS" />
            <bitfield mask="0x00002000" name="USESTK" />
            <bitfield mask="0x00004000" name="APE" />
            <bitfield mask="0x00008000" name="CLREXL" />
            <bitfield mask="0x001F0000" name="STKDEC" />
            <bitfield mask="0x00200000" name="ICE" />
            <bitfield mask="0x00400000" name="PF" />
         </register>
         <register caption="" name="SRSCtl" offset="0xc8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CSS" />
            <bitfield mask="0x000003C0" name="PSS" />
            <bitfield mask="0x0000F000" name="ESS" />
            <bitfield mask="0x003C0000" name="EICSS" />
            <bitfield mask="0x3C000000" name="HSS" />
         </register>
         <register caption="" name="SRSMap" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SSV0" />
            <bitfield mask="0x000000F0" name="SSV1" />
            <bitfield mask="0x00000F00" name="SSV2" />
            <bitfield mask="0x0000F000" name="SSV3" />
            <bitfield mask="0x000F0000" name="SSV4" />
            <bitfield mask="0x00F00000" name="SSV5" />
            <bitfield mask="0x0F000000" name="SSV6" />
            <bitfield mask="0xF0000000" name="SSV7" />
         </register>
         <register caption="" name="View_IPL" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x000003FC" name="IPL" />
         </register>
         <register caption="" name="SRSMAP2" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SSV8" />
            <bitfield mask="0x000000F0" name="SSV9" />
         </register>
         <register caption="" name="GTOffset" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="GTOffset" />
         </register>
         <register caption="" name="Cause" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0x0000007C" name="ExcCode" />
            <bitfield mask="0x00000300" name="IP" />
            <bitfield mask="0x0003FC00" name="RIPL" />
            <bitfield mask="0x00200000" name="FDCI" />
            <bitfield mask="0x00400000" name="WP" />
            <bitfield mask="0x00800000" name="IV" />
            <bitfield mask="0x01000000" name="AP" />
            <bitfield mask="0x02000000" name="IC" />
            <bitfield mask="0x04000000" name="PCI" />
            <bitfield mask="0x08000000" name="DC" />
            <bitfield mask="0x30000000" name="CE" />
            <bitfield mask="0x40000000" name="TI" />
            <bitfield mask="0x80000000" name="BD" />
         </register>
         <register caption="" name="View_RIPL" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IP" />
            <bitfield mask="0x000003FC" name="RIPL" />
         </register>
         <register caption="" name="NestedExc" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0x0000000C" name="NEXL" />
            <bitfield mask="0x00000030" name="NERL" />
         </register>
         <register caption="" name="EPC" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="EPC" />
         </register>
         <register caption="" name="NestedEPC" offset="0xec" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="EPC" />
         </register>
         <register caption="" name="PRId" offset="0xf0" rw="R" size="4">
            <bitfield mask="0x00000003" name="Patch" />
            <bitfield mask="0x0000001C" name="MINrev" />
            <bitfield mask="0x000000E0" name="MAJrev" />
            <bitfield mask="0x0000FF00" name="PrID" />
            <bitfield mask="0x00FF0000" name="CoID" />
         </register>
