Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH048.atdf
         <register caption="" name="CNSTATF" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATF" />
            <bitfield mask="0x00000002" name="CNSTATF" />
            <bitfield mask="0x00000004" name="CNSTATF" />
            <bitfield mask="0x00000008" name="CNSTATF" />
            <bitfield mask="0x00000010" name="CNSTATF" />
            <bitfield mask="0x00000020" name="CNSTATF" />
            <bitfield mask="0x00000040" name="CNSTATF" />
            <bitfield mask="0x00000080" name="CNSTATF" />
            <bitfield mask="0x00000100" name="CNSTATF" />
            <bitfield mask="0x00000200" name="CNSTATF" />
            <bitfield mask="0x00000400" name="CNSTATF" />
            <bitfield mask="0x00000800" name="CNSTATF" />
            <bitfield mask="0x00001000" name="CNSTATF" />
            <bitfield mask="0x00002000" name="CNSTATF" />
            <bitfield mask="0x00004000" name="CNSTATF" />
            <bitfield mask="0x00008000" name="CNSTATF" />
         </register>
         <register caption="" name="CNSTATG" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATG" />
            <bitfield mask="0x00000002" name="CNSTATG" />
            <bitfield mask="0x00000004" name="CNSTATG" />
            <bitfield mask="0x00000008" name="CNSTATG" />
            <bitfield mask="0x00000010" name="CNSTATG" />
            <bitfield mask="0x00000020" name="CNSTATG" />
            <bitfield mask="0x00000040" name="CNSTATG" />
            <bitfield mask="0x00000080" name="CNSTATG" />
            <bitfield mask="0x00000100" name="CNSTATG" />
            <bitfield mask="0x00000200" name="CNSTATG" />
            <bitfield mask="0x00000400" name="CNSTATG" />
            <bitfield mask="0x00000800" name="CNSTATG" />
            <bitfield mask="0x00001000" name="CNSTATG" />
            <bitfield mask="0x00002000" name="CNSTATG" />
            <bitfield mask="0x00004000" name="CNSTATG" />
            <bitfield mask="0x00008000" name="CNSTATG" />
         </register>
         <register caption="" name="CNNEA" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEA" />
            <bitfield mask="0x00000002" name="CNNEA" />
            <bitfield mask="0x00000004" name="CNNEA" />
            <bitfield mask="0x00000008" name="CNNEA" />
            <bitfield mask="0x00000010" name="CNNEA" />
            <bitfield mask="0x00000020" name="CNNEA" />
            <bitfield mask="0x00000040" name="CNNEA" />
            <bitfield mask="0x00000080" name="CNNEA" />
            <bitfield mask="0x00000100" name="CNNEA" />
            <bitfield mask="0x00000200" name="CNNEA" />
            <bitfield mask="0x00000400" name="CNNEA" />
            <bitfield mask="0x00000800" name="CNNEA" />
            <bitfield mask="0x00001000" name="CNNEA" />
            <bitfield mask="0x00002000" name="CNNEA" />
            <bitfield mask="0x00004000" name="CNNEA" />
            <bitfield mask="0x00008000" name="CNNEA" />
         </register>
         <register caption="" name="CNNEB" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEB" />
            <bitfield mask="0x00000002" name="CNNEB" />
            <bitfield mask="0x00000004" name="CNNEB" />
            <bitfield mask="0x00000008" name="CNNEB" />
            <bitfield mask="0x00000010" name="CNNEB" />
            <bitfield mask="0x00000020" name="CNNEB" />
            <bitfield mask="0x00000040" name="CNNEB" />
            <bitfield mask="0x00000080" name="CNNEB" />
            <bitfield mask="0x00000100" name="CNNEB" />
            <bitfield mask="0x00000200" name="CNNEB" />
            <bitfield mask="0x00000400" name="CNNEB" />
            <bitfield mask="0x00000800" name="CNNEB" />
            <bitfield mask="0x00001000" name="CNNEB" />
            <bitfield mask="0x00002000" name="CNNEB" />
            <bitfield mask="0x00004000" name="CNNEB" />
            <bitfield mask="0x00008000" name="CNNEB" />
         </register>
         <register caption="" name="CNNEC" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEC" />
            <bitfield mask="0x00000002" name="CNNEC" />
            <bitfield mask="0x00000004" name="CNNEC" />
            <bitfield mask="0x00000008" name="CNNEC" />
            <bitfield mask="0x00000010" name="CNNEC" />
            <bitfield mask="0x00000020" name="CNNEC" />
            <bitfield mask="0x00000040" name="CNNEC" />
            <bitfield mask="0x00000080" name="CNNEC" />
            <bitfield mask="0x00000100" name="CNNEC" />
            <bitfield mask="0x00000200" name="CNNEC" />
            <bitfield mask="0x00000400" name="CNNEC" />
            <bitfield mask="0x00000800" name="CNNEC" />
            <bitfield mask="0x00001000" name="CNNEC" />
            <bitfield mask="0x00002000" name="CNNEC" />
            <bitfield mask="0x00004000" name="CNNEC" />
            <bitfield mask="0x00008000" name="CNNEC" />
         </register>
         <register caption="" name="CNNED" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNED" />
            <bitfield mask="0x00000002" name="CNNED" />
            <bitfield mask="0x00000004" name="CNNED" />
            <bitfield mask="0x00000008" name="CNNED" />
            <bitfield mask="0x00000010" name="CNNED" />
            <bitfield mask="0x00000020" name="CNNED" />
            <bitfield mask="0x00000040" name="CNNED" />
            <bitfield mask="0x00000080" name="CNNED" />
            <bitfield mask="0x00000100" name="CNNED" />
            <bitfield mask="0x00000200" name="CNNED" />
            <bitfield mask="0x00000400" name="CNNED" />
            <bitfield mask="0x00000800" name="CNNED" />
            <bitfield mask="0x00001000" name="CNNED" />
            <bitfield mask="0x00002000" name="CNNED" />
            <bitfield mask="0x00004000" name="CNNED" />
            <bitfield mask="0x00008000" name="CNNED" />
         </register>
         <register caption="" name="CNNEE" offset="0x4a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEE" />
            <bitfield mask="0x00000002" name="CNNEE" />
            <bitfield mask="0x00000004" name="CNNEE" />
            <bitfield mask="0x00000008" name="CNNEE" />
            <bitfield mask="0x00000010" name="CNNEE" />
            <bitfield mask="0x00000020" name="CNNEE" />
            <bitfield mask="0x00000040" name="CNNEE" />
            <bitfield mask="0x00000080" name="CNNEE" />
            <bitfield mask="0x00000100" name="CNNEE" />
            <bitfield mask="0x00000200" name="CNNEE" />
            <bitfield mask="0x00000400" name="CNNEE" />
            <bitfield mask="0x00000800" name="CNNEE" />
            <bitfield mask="0x00001000" name="CNNEE" />
            <bitfield mask="0x00002000" name="CNNEE" />
            <bitfield mask="0x00004000" name="CNNEE" />
            <bitfield mask="0x00008000" name="CNNEE" />
         </register>
